In [1]:
# 블로그에 포스팅하기 위한 스타일 조정
from IPython.core.display import display, HTML
display(HTML("<style> .container{width:90% !important;}</style>"))

In [9]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

# 5.Pandas DataFrame 산술 연산

DataFrame 의 연산은 아래의 두 가지 케이스가 있다.
- DataFrame vs DataFrame 연산
- DataFrame vs Series 연산

## 5.1 DataFrame vs DataFrame 연산

DataFrame의 연산 규칙은 아래와 같다.
- 같은 index 이면서 같은 column 명을 가진 두 value를 연산함
- 같은 index 이면서 같은 column 명을 가진 두 value 중 하나라도 NaN이 있으면 NaN으로 채워진다.
- index나 column 명이 다르면 NaN으로 채워진다.
<img src = "img/OperationRule.jpg" alt="OperationRule" />

연산하는 방법에는 두 가지 방법이 있다.
- 연산자를 이용한 연산 ( +, -, *, / )
- 함수를 이용한 연산 ( add, sub, mul, div )

기본 연산은 동일하지만 함수를 사용하면 fill_value와 axis 옵션을 사용할 수 있다.

Ex) df1.add(df2, fill_value = 0, axis = 0)
- fill_value = 0 : NaN값을 0으로 간주하고 연산, 0이 아닌 값 입력 가능
- axis = 0 : DataFrame와 Series간의 연산에서 방향을 지정(5.1.2 참고)

<img src = "img/OperationRule2.jpg" alt="OperationRule2" />

곱하기, 나누기, 빼기 등도 동일한 방법이므로, 더하기만 실습해보겠다.

In [22]:
df1 = DataFrame([[1,3,5],[7,9,11],[5,13,15]])
df1

   0   1   2
0  1   3   5
1  7   9  11
2  5  13  15

In [26]:
df2 = DataFrame([[1,2,3],[4,np.nan,6],[7,8,9]], columns=[0,1,3], index=[0,1,3])
df2

   0    1  3
0  1  2.0  3
1  4  NaN  6
3  7  8.0  9

In [31]:
df1 + df2

      0    1   2   3
0   2.0  5.0 NaN NaN
1  11.0  NaN NaN NaN
2   NaN  NaN NaN NaN
3   NaN  NaN NaN NaN

In [38]:
df1.add(df2,fill_value=0)

      0     1     2    3
0   2.0   5.0   5.0  3.0
1  11.0   9.0  11.0  6.0
2   5.0  13.0  15.0  NaN
3   7.0   8.0   NaN  9.0

## 5.2 DataFrame vs Series 연산

연산 함수(add, sub, mul, div) 의 axis 옵션을 통해 행, 열 방향으로 연산 가능

Ex) df1.add(df2, axis = 0)

axis = 0 : Index방향(행방향)으로 DataFrame과 Series 연산
- DataFrame과 Series가 동일한 Index를 가지면 연산, 다르면거나 한쪽만 있으면 NaN

axis = 1 : Column방향으로 DataFrame과 Series 연산
- DataFrame과 Series가 동일한 Column명을 가지면 연산, 다르면거나 한쪽만 있으면 NaN

In [40]:
s1 = Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [42]:
df1

   0   1   2
0  1   3   5
1  7   9  11
2  5  13  15

In [47]:
df1.add(s1, axis = 0)

     0     1     2
0  2.0   4.0   6.0
1  9.0  11.0  13.0
2  8.0  16.0  18.0
3  NaN   NaN   NaN

In [48]:
df1.add(s1, axis = 1)

   0   1   2   3
0  2   5   8 NaN
1  8  11  14 NaN
2  6  15  18 NaN